# XraySafe-YOLO optimization candidate C:
# CGOA on P3/P4 + residual-gated LSAFF with per-location spatial scale weights.
# This is closer to ASFF-style local fusion while retaining the target-scale
# residual branch for stability.
nc: 80
scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]  # 16: P3
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]  # 19: P4
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]  # 22: P5
  - [16, 1, CGOA, [256]]         # 23: P3'
  - [19, 1, CGOA, [512]]         # 24: P4'
  - [[23, 24, 22], 1, LSAFF, [256, 0, True, True, -2.0, True]]   # 25: P3_out
  - [[23, 24, 22], 1, LSAFF, [512, 1, True, True, -2.0, True]]   # 26: P4_out
  - [[23, 24, 22], 1, LSAFF, [1024, 2, True, True, -2.0, True]]  # 27: P5_out
  - [[25, 26, 27], 1, Detect, [nc]]
